zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CSTCU.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_CSTCU.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_CSTCU
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_CSTCU_H_)  /* Check if memory map has not been already included */
#define S32K566_CSTCU_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- CSTCU Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CSTCU_Peripheral_Access_Layer CSTCU Peripheral Access Layer
 * @{
 */

/** CSTCU - Size of Registers Arrays */
#define CSTCU_LRFSTAT_COUNT                       1u
#define CSTCU_LUFSTAT_COUNT                       1u
#define CSTCU_BYPLSTCU_COUNT                      1u
#define CSTCU_LSTCU_MBSCH_COUNT                   12u
#define CSTCU_LSTCU_LBSCH_COUNT                   12u

/** CSTCU - Register Layout Typedef */
typedef struct CSTCU_Struct {
  __IO uint32_t RUNSWREG;                          /**< Run Software, offset: 0x0 */
  __IO uint32_t LSCHLVLD;                          /**< LSTCU Scheduler List Valid, offset: 0x4 */
  uint8_t RESERVED_0[4];
  __IO uint32_t WDG;                               /**< Watchdog Timer, offset: 0xC */
  __IO uint32_t IE;                                /**< Interrupt Enable, offset: 0x10 */
  __IO uint32_t IF;                                /**< Interrupt Flag, offset: 0x14 */
  uint8_t RESERVED_1[8];
  __IO uint32_t ERR_STAT;                          /**< Error Status, offset: 0x20 */
  uint8_t RESERVED_2[4];
  __IO uint32_t ERR_FM;                            /**< Error Fault Mapping, offset: 0x28 */
  uint8_t RESERVED_3[4];
  __I  uint32_t LRFSTAT[CSTCU_LRFSTAT_COUNT];      /**< LSTCU Recoverable Fault Status, array offset: 0x30, array step: 0x4 */
  uint8_t RESERVED_4[12];
  __I  uint32_t LUFSTAT[CSTCU_LUFSTAT_COUNT];      /**< LSTCU Unrecoverable Fault Status, array offset: 0x40, array step: 0x4 */
  uint8_t RESERVED_5[12];
  __IO uint32_t RDEN;                              /**< Reset Domain Self-Test Enable, offset: 0x50 */
  __I  uint32_t RDENSTAT;                          /**< Reset Domain Enable Status, offset: 0x54 */
  __I  uint32_t LASTRDEN;                          /**< Last Run Reset Domain Enable, offset: 0x58 */
  uint8_t RESERVED_6[4];
  __IO uint32_t BYPLSTCU[CSTCU_BYPLSTCU_COUNT];    /**< Bypass LSTCU, array offset: 0x60, array step: 0x4 */
  uint8_t RESERVED_7[12];
  __IO uint32_t STAG;                              /**< Stagger, offset: 0x70 */
  uint8_t RESERVED_8[396];
  __IO uint32_t LMBPTR[CSTCU_LSTCU_MBSCH_COUNT];   /**< LSTCU MBIST Run Phase Scheduler Pointer, array offset: 0x200, array step: 0x4 */
  uint8_t RESERVED_9[208];
  __IO uint32_t LLBPTR[CSTCU_LSTCU_LBSCH_COUNT];   /**< LSTCU LBIST Run phase Scheduler Pointer, array offset: 0x300, array step: 0x4 */
} CSTCU_Type, *CSTCU_MemMapPtr;

/** Number of instances of the CSTCU module. */
#define CSTCU_INSTANCE_COUNT                     (1u)

/* CSTCU - Peripheral instance base addresses */
/** Peripheral CSTCU base address */
#define IP_CSTCU_BASE                            (0x404C0000u)
/** Peripheral CSTCU base pointer */
#define IP_CSTCU                                 ((CSTCU_Type *)IP_CSTCU_BASE)
/** Array initializer of CSTCU peripheral base addresses */
#define IP_CSTCU_BASE_ADDRS                      { IP_CSTCU_BASE }
/** Array initializer of CSTCU peripheral base pointers */
#define IP_CSTCU_BASE_PTRS                       { IP_CSTCU }

/* ----------------------------------------------------------------------------
   -- CSTCU Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CSTCU_Register_Masks CSTCU Register Masks
 * @{
 */

/*! @name RUNSWREG - Run Software */
/*! @{ */

#define CSTCU_RUNSWREG_RUNSW_MASK                (0x1U)
#define CSTCU_RUNSWREG_RUNSW_SHIFT               (0U)
#define CSTCU_RUNSWREG_RUNSW_WIDTH               (1U)
#define CSTCU_RUNSWREG_RUNSW(x)                  (((uint32_t)(((uint32_t)(x)) << CSTCU_RUNSWREG_RUNSW_SHIFT)) & CSTCU_RUNSWREG_RUNSW_MASK)
/*! @} */

/*! @name LSCHLVLD - LSTCU Scheduler List Valid */
/*! @{ */

#define CSTCU_LSCHLVLD_MBPLVLD_MASK              (0x100U)
#define CSTCU_LSCHLVLD_MBPLVLD_SHIFT             (8U)
#define CSTCU_LSCHLVLD_MBPLVLD_WIDTH             (1U)
#define CSTCU_LSCHLVLD_MBPLVLD(x)                (((uint32_t)(((uint32_t)(x)) << CSTCU_LSCHLVLD_MBPLVLD_SHIFT)) & CSTCU_LSCHLVLD_MBPLVLD_MASK)

#define CSTCU_LSCHLVLD_LBPLVLD_MASK              (0x10000U)
#define CSTCU_LSCHLVLD_LBPLVLD_SHIFT             (16U)
#define CSTCU_LSCHLVLD_LBPLVLD_WIDTH             (1U)
#define CSTCU_LSCHLVLD_LBPLVLD(x)                (((uint32_t)(((uint32_t)(x)) << CSTCU_LSCHLVLD_LBPLVLD_SHIFT)) & CSTCU_LSCHLVLD_LBPLVLD_MASK)
/*! @} */

/*! @name WDG - Watchdog Timer */
/*! @{ */

#define CSTCU_WDG_WDGEOC_MASK                    (0xFFFFFFFFU)
#define CSTCU_WDG_WDGEOC_SHIFT                   (0U)
#define CSTCU_WDG_WDGEOC_WIDTH                   (32U)
#define CSTCU_WDG_WDGEOC(x)                      (((uint32_t)(((uint32_t)(x)) << CSTCU_WDG_WDGEOC_SHIFT)) & CSTCU_WDG_WDGEOC_MASK)
/*! @} */

/*! @name IE - Interrupt Enable */
/*! @{ */

