zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CSTCU.h
#define CSTCU_IE_STEND_IE_MASK                   (0x1U)
#define CSTCU_IE_STEND_IE_SHIFT                  (0U)
#define CSTCU_IE_STEND_IE_WIDTH                  (1U)
#define CSTCU_IE_STEND_IE(x)                     (((uint32_t)(((uint32_t)(x)) << CSTCU_IE_STEND_IE_SHIFT)) & CSTCU_IE_STEND_IE_MASK)
/*! @} */

/*! @name IF - Interrupt Flag */
/*! @{ */

#define CSTCU_IF_STEND_IF_MASK                   (0x1U)
#define CSTCU_IF_STEND_IF_SHIFT                  (0U)
#define CSTCU_IF_STEND_IF_WIDTH                  (1U)
#define CSTCU_IF_STEND_IF(x)                     (((uint32_t)(((uint32_t)(x)) << CSTCU_IF_STEND_IF_SHIFT)) & CSTCU_IF_STEND_IF_MASK)
/*! @} */

/*! @name ERR_STAT - Error Status */
/*! @{ */

#define CSTCU_ERR_STAT_INVP_MB_MASK              (0x2U)
#define CSTCU_ERR_STAT_INVP_MB_SHIFT             (1U)
#define CSTCU_ERR_STAT_INVP_MB_WIDTH             (1U)
#define CSTCU_ERR_STAT_INVP_MB(x)                (((uint32_t)(((uint32_t)(x)) << CSTCU_ERR_STAT_INVP_MB_SHIFT)) & CSTCU_ERR_STAT_INVP_MB_MASK)

#define CSTCU_ERR_STAT_INVP_LB_MASK              (0x4U)
#define CSTCU_ERR_STAT_INVP_LB_SHIFT             (2U)
#define CSTCU_ERR_STAT_INVP_LB_WIDTH             (1U)
#define CSTCU_ERR_STAT_INVP_LB(x)                (((uint32_t)(((uint32_t)(x)) << CSTCU_ERR_STAT_INVP_LB_SHIFT)) & CSTCU_ERR_STAT_INVP_LB_MASK)

#define CSTCU_ERR_STAT_ABORTHW_MASK              (0x100U)
#define CSTCU_ERR_STAT_ABORTHW_SHIFT             (8U)
#define CSTCU_ERR_STAT_ABORTHW_WIDTH             (1U)
#define CSTCU_ERR_STAT_ABORTHW(x)                (((uint32_t)(((uint32_t)(x)) << CSTCU_ERR_STAT_ABORTHW_SHIFT)) & CSTCU_ERR_STAT_ABORTHW_MASK)

#define CSTCU_ERR_STAT_UFSF_MASK                 (0x10000U)
#define CSTCU_ERR_STAT_UFSF_SHIFT                (16U)
#define CSTCU_ERR_STAT_UFSF_WIDTH                (1U)
#define CSTCU_ERR_STAT_UFSF(x)                   (((uint32_t)(((uint32_t)(x)) << CSTCU_ERR_STAT_UFSF_SHIFT)) & CSTCU_ERR_STAT_UFSF_MASK)

#define CSTCU_ERR_STAT_RFSF_MASK                 (0x20000U)
#define CSTCU_ERR_STAT_RFSF_SHIFT                (17U)
#define CSTCU_ERR_STAT_RFSF_WIDTH                (1U)
#define CSTCU_ERR_STAT_RFSF(x)                   (((uint32_t)(((uint32_t)(x)) << CSTCU_ERR_STAT_RFSF_SHIFT)) & CSTCU_ERR_STAT_RFSF_MASK)
/*! @} */

/*! @name ERR_FM - Error Fault Mapping */
/*! @{ */

#define CSTCU_ERR_FM_INVPFMMB_MASK               (0x2U)
#define CSTCU_ERR_FM_INVPFMMB_SHIFT              (1U)
#define CSTCU_ERR_FM_INVPFMMB_WIDTH              (1U)
#define CSTCU_ERR_FM_INVPFMMB(x)                 (((uint32_t)(((uint32_t)(x)) << CSTCU_ERR_FM_INVPFMMB_SHIFT)) & CSTCU_ERR_FM_INVPFMMB_MASK)

#define CSTCU_ERR_FM_INVPFMLB_MASK               (0x4U)
#define CSTCU_ERR_FM_INVPFMLB_SHIFT              (2U)
#define CSTCU_ERR_FM_INVPFMLB_WIDTH              (1U)
#define CSTCU_ERR_FM_INVPFMLB(x)                 (((uint32_t)(((uint32_t)(x)) << CSTCU_ERR_FM_INVPFMLB_SHIFT)) & CSTCU_ERR_FM_INVPFMLB_MASK)
/*! @} */

/*! @name LRFSTAT - LSTCU Recoverable Fault Status */
/*! @{ */

#define CSTCU_LRFSTAT_RFSLSTCU0_MASK             (0x1U)
#define CSTCU_LRFSTAT_RFSLSTCU0_SHIFT            (0U)
#define CSTCU_LRFSTAT_RFSLSTCU0_WIDTH            (1U)
#define CSTCU_LRFSTAT_RFSLSTCU0(x)               (((uint32_t)(((uint32_t)(x)) << CSTCU_LRFSTAT_RFSLSTCU0_SHIFT)) & CSTCU_LRFSTAT_RFSLSTCU0_MASK)

#define CSTCU_LRFSTAT_RFSLSTCU1_MASK             (0x2U)
#define CSTCU_LRFSTAT_RFSLSTCU1_SHIFT            (1U)
#define CSTCU_LRFSTAT_RFSLSTCU1_WIDTH            (1U)
#define CSTCU_LRFSTAT_RFSLSTCU1(x)               (((uint32_t)(((uint32_t)(x)) << CSTCU_LRFSTAT_RFSLSTCU1_SHIFT)) & CSTCU_LRFSTAT_RFSLSTCU1_MASK)

#define CSTCU_LRFSTAT_RFSLSTCU2_MASK             (0x4U)
#define CSTCU_LRFSTAT_RFSLSTCU2_SHIFT            (2U)
#define CSTCU_LRFSTAT_RFSLSTCU2_WIDTH            (1U)
#define CSTCU_LRFSTAT_RFSLSTCU2(x)               (((uint32_t)(((uint32_t)(x)) << CSTCU_LRFSTAT_RFSLSTCU2_SHIFT)) & CSTCU_LRFSTAT_RFSLSTCU2_MASK)

#define CSTCU_LRFSTAT_RFSLSTCU3_MASK             (0x8U)
#define CSTCU_LRFSTAT_RFSLSTCU3_SHIFT            (3U)
#define CSTCU_LRFSTAT_RFSLSTCU3_WIDTH            (1U)
#define CSTCU_LRFSTAT_RFSLSTCU3(x)               (((uint32_t)(((uint32_t)(x)) << CSTCU_LRFSTAT_RFSLSTCU3_SHIFT)) & CSTCU_LRFSTAT_RFSLSTCU3_MASK)

#define CSTCU_LRFSTAT_RFSLSTCU4_MASK             (0x10U)
#define CSTCU_LRFSTAT_RFSLSTCU4_SHIFT            (4U)
#define CSTCU_LRFSTAT_RFSLSTCU4_WIDTH            (1U)
#define CSTCU_LRFSTAT_RFSLSTCU4(x)               (((uint32_t)(((uint32_t)(x)) << CSTCU_LRFSTAT_RFSLSTCU4_SHIFT)) & CSTCU_LRFSTAT_RFSLSTCU4_MASK)

#define CSTCU_LRFSTAT_RFSLSTCU5_MASK             (0x20U)
#define CSTCU_LRFSTAT_RFSLSTCU5_SHIFT            (5U)
#define CSTCU_LRFSTAT_RFSLSTCU5_WIDTH            (1U)
#define CSTCU_LRFSTAT_RFSLSTCU5(x)               (((uint32_t)(((uint32_t)(x)) << CSTCU_LRFSTAT_RFSLSTCU5_SHIFT)) & CSTCU_LRFSTAT_RFSLSTCU5_MASK)

#define CSTCU_LRFSTAT_RFSLSTCU6_MASK             (0x40U)
#define CSTCU_LRFSTAT_RFSLSTCU6_SHIFT            (6U)
#define CSTCU_LRFSTAT_RFSLSTCU6_WIDTH            (1U)
#define CSTCU_LRFSTAT_RFSLSTCU6(x)               (((uint32_t)(((uint32_t)(x)) << CSTCU_LRFSTAT_RFSLSTCU6_SHIFT)) & CSTCU_LRFSTAT_RFSLSTCU6_MASK)

#define CSTCU_LRFSTAT_RFSLSTCU7_MASK             (0x80U)
#define CSTCU_LRFSTAT_RFSLSTCU7_SHIFT            (7U)
#define CSTCU_LRFSTAT_RFSLSTCU7_WIDTH            (1U)
#define CSTCU_LRFSTAT_RFSLSTCU7(x)               (((uint32_t)(((uint32_t)(x)) << CSTCU_LRFSTAT_RFSLSTCU7_SHIFT)) & CSTCU_LRFSTAT_RFSLSTCU7_MASK)

#define CSTCU_LRFSTAT_RFSLSTCU8_MASK             (0x100U)
#define CSTCU_LRFSTAT_RFSLSTCU8_SHIFT            (8U)
#define CSTCU_LRFSTAT_RFSLSTCU8_WIDTH            (1U)
#define CSTCU_LRFSTAT_RFSLSTCU8(x)               (((uint32_t)(((uint32_t)(x)) << CSTCU_LRFSTAT_RFSLSTCU8_SHIFT)) & CSTCU_LRFSTAT_RFSLSTCU8_MASK)

#define CSTCU_LRFSTAT_RFSLSTCU9_MASK             (0x200U)
#define CSTCU_LRFSTAT_RFSLSTCU9_SHIFT            (9U)
#define CSTCU_LRFSTAT_RFSLSTCU9_WIDTH            (1U)
#define CSTCU_LRFSTAT_RFSLSTCU9(x)               (((uint32_t)(((uint32_t)(x)) << CSTCU_LRFSTAT_RFSLSTCU9_SHIFT)) & CSTCU_LRFSTAT_RFSLSTCU9_MASK)

#define CSTCU_LRFSTAT_RFSLSTCU10_MASK            (0x400U)
#define CSTCU_LRFSTAT_RFSLSTCU10_SHIFT           (10U)
#define CSTCU_LRFSTAT_RFSLSTCU10_WIDTH           (1U)
#define CSTCU_LRFSTAT_RFSLSTCU10(x)              (((uint32_t)(((uint32_t)(x)) << CSTCU_LRFSTAT_RFSLSTCU10_SHIFT)) & CSTCU_LRFSTAT_RFSLSTCU10_MASK)

#define CSTCU_LRFSTAT_RFSLSTCU11_MASK            (0x800U)
#define CSTCU_LRFSTAT_RFSLSTCU11_SHIFT           (11U)
#define CSTCU_LRFSTAT_RFSLSTCU11_WIDTH           (1U)
#define CSTCU_LRFSTAT_RFSLSTCU11(x)              (((uint32_t)(((uint32_t)(x)) << CSTCU_LRFSTAT_RFSLSTCU11_SHIFT)) & CSTCU_LRFSTAT_RFSLSTCU11_MASK)
/*! @} */

/*! @name LUFSTAT - LSTCU Unrecoverable Fault Status */
/*! @{ */

#define CSTCU_LUFSTAT_UFSLSTCU0_MASK             (0x1U)
#define CSTCU_LUFSTAT_UFSLSTCU0_SHIFT            (0U)
#define CSTCU_LUFSTAT_UFSLSTCU0_WIDTH            (1U)
#define CSTCU_LUFSTAT_UFSLSTCU0(x)               (((uint32_t)(((uint32_t)(x)) << CSTCU_LUFSTAT_UFSLSTCU0_SHIFT)) & CSTCU_LUFSTAT_UFSLSTCU0_MASK)

