zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CSTCU.h
#define CSTCU_LUFSTAT_UFSLSTCU1_MASK             (0x2U)
#define CSTCU_LUFSTAT_UFSLSTCU1_SHIFT            (1U)
#define CSTCU_LUFSTAT_UFSLSTCU1_WIDTH            (1U)
#define CSTCU_LUFSTAT_UFSLSTCU1(x)               (((uint32_t)(((uint32_t)(x)) << CSTCU_LUFSTAT_UFSLSTCU1_SHIFT)) & CSTCU_LUFSTAT_UFSLSTCU1_MASK)

#define CSTCU_LUFSTAT_UFSLSTCU2_MASK             (0x4U)
#define CSTCU_LUFSTAT_UFSLSTCU2_SHIFT            (2U)
#define CSTCU_LUFSTAT_UFSLSTCU2_WIDTH            (1U)
#define CSTCU_LUFSTAT_UFSLSTCU2(x)               (((uint32_t)(((uint32_t)(x)) << CSTCU_LUFSTAT_UFSLSTCU2_SHIFT)) & CSTCU_LUFSTAT_UFSLSTCU2_MASK)

#define CSTCU_LUFSTAT_UFSLSTCU3_MASK             (0x8U)
#define CSTCU_LUFSTAT_UFSLSTCU3_SHIFT            (3U)
#define CSTCU_LUFSTAT_UFSLSTCU3_WIDTH            (1U)
#define CSTCU_LUFSTAT_UFSLSTCU3(x)               (((uint32_t)(((uint32_t)(x)) << CSTCU_LUFSTAT_UFSLSTCU3_SHIFT)) & CSTCU_LUFSTAT_UFSLSTCU3_MASK)

#define CSTCU_LUFSTAT_UFSLSTCU4_MASK             (0x10U)
#define CSTCU_LUFSTAT_UFSLSTCU4_SHIFT            (4U)
#define CSTCU_LUFSTAT_UFSLSTCU4_WIDTH            (1U)
#define CSTCU_LUFSTAT_UFSLSTCU4(x)               (((uint32_t)(((uint32_t)(x)) << CSTCU_LUFSTAT_UFSLSTCU4_SHIFT)) & CSTCU_LUFSTAT_UFSLSTCU4_MASK)

#define CSTCU_LUFSTAT_UFSLSTCU5_MASK             (0x20U)
#define CSTCU_LUFSTAT_UFSLSTCU5_SHIFT            (5U)
#define CSTCU_LUFSTAT_UFSLSTCU5_WIDTH            (1U)
#define CSTCU_LUFSTAT_UFSLSTCU5(x)               (((uint32_t)(((uint32_t)(x)) << CSTCU_LUFSTAT_UFSLSTCU5_SHIFT)) & CSTCU_LUFSTAT_UFSLSTCU5_MASK)

#define CSTCU_LUFSTAT_UFSLSTCU6_MASK             (0x40U)
#define CSTCU_LUFSTAT_UFSLSTCU6_SHIFT            (6U)
#define CSTCU_LUFSTAT_UFSLSTCU6_WIDTH            (1U)
#define CSTCU_LUFSTAT_UFSLSTCU6(x)               (((uint32_t)(((uint32_t)(x)) << CSTCU_LUFSTAT_UFSLSTCU6_SHIFT)) & CSTCU_LUFSTAT_UFSLSTCU6_MASK)

#define CSTCU_LUFSTAT_UFSLSTCU7_MASK             (0x80U)
#define CSTCU_LUFSTAT_UFSLSTCU7_SHIFT            (7U)
#define CSTCU_LUFSTAT_UFSLSTCU7_WIDTH            (1U)
#define CSTCU_LUFSTAT_UFSLSTCU7(x)               (((uint32_t)(((uint32_t)(x)) << CSTCU_LUFSTAT_UFSLSTCU7_SHIFT)) & CSTCU_LUFSTAT_UFSLSTCU7_MASK)

#define CSTCU_LUFSTAT_UFSLSTCU8_MASK             (0x100U)
#define CSTCU_LUFSTAT_UFSLSTCU8_SHIFT            (8U)
#define CSTCU_LUFSTAT_UFSLSTCU8_WIDTH            (1U)
#define CSTCU_LUFSTAT_UFSLSTCU8(x)               (((uint32_t)(((uint32_t)(x)) << CSTCU_LUFSTAT_UFSLSTCU8_SHIFT)) & CSTCU_LUFSTAT_UFSLSTCU8_MASK)

#define CSTCU_LUFSTAT_UFSLSTCU9_MASK             (0x200U)
#define CSTCU_LUFSTAT_UFSLSTCU9_SHIFT            (9U)
#define CSTCU_LUFSTAT_UFSLSTCU9_WIDTH            (1U)
#define CSTCU_LUFSTAT_UFSLSTCU9(x)               (((uint32_t)(((uint32_t)(x)) << CSTCU_LUFSTAT_UFSLSTCU9_SHIFT)) & CSTCU_LUFSTAT_UFSLSTCU9_MASK)

#define CSTCU_LUFSTAT_UFSLSTCU10_MASK            (0x400U)
#define CSTCU_LUFSTAT_UFSLSTCU10_SHIFT           (10U)
#define CSTCU_LUFSTAT_UFSLSTCU10_WIDTH           (1U)
#define CSTCU_LUFSTAT_UFSLSTCU10(x)              (((uint32_t)(((uint32_t)(x)) << CSTCU_LUFSTAT_UFSLSTCU10_SHIFT)) & CSTCU_LUFSTAT_UFSLSTCU10_MASK)

#define CSTCU_LUFSTAT_UFSLSTCU11_MASK            (0x800U)
#define CSTCU_LUFSTAT_UFSLSTCU11_SHIFT           (11U)
#define CSTCU_LUFSTAT_UFSLSTCU11_WIDTH           (1U)
#define CSTCU_LUFSTAT_UFSLSTCU11(x)              (((uint32_t)(((uint32_t)(x)) << CSTCU_LUFSTAT_UFSLSTCU11_SHIFT)) & CSTCU_LUFSTAT_UFSLSTCU11_MASK)
/*! @} */

/*! @name RDEN - Reset Domain Self-Test Enable */
/*! @{ */

#define CSTCU_RDEN_SERD0_MASK                    (0x1U)
#define CSTCU_RDEN_SERD0_SHIFT                   (0U)
#define CSTCU_RDEN_SERD0_WIDTH                   (1U)
#define CSTCU_RDEN_SERD0(x)                      (((uint32_t)(((uint32_t)(x)) << CSTCU_RDEN_SERD0_SHIFT)) & CSTCU_RDEN_SERD0_MASK)
/*! @} */

/*! @name RDENSTAT - Reset Domain Enable Status */
/*! @{ */

#define CSTCU_RDENSTAT_SESRD0_MASK               (0x1U)
#define CSTCU_RDENSTAT_SESRD0_SHIFT              (0U)
#define CSTCU_RDENSTAT_SESRD0_WIDTH              (1U)
#define CSTCU_RDENSTAT_SESRD0(x)                 (((uint32_t)(((uint32_t)(x)) << CSTCU_RDENSTAT_SESRD0_SHIFT)) & CSTCU_RDENSTAT_SESRD0_MASK)
/*! @} */

/*! @name LASTRDEN - Last Run Reset Domain Enable */
/*! @{ */

#define CSTCU_LASTRDEN_LRSERD0_MASK              (0x1U)
#define CSTCU_LASTRDEN_LRSERD0_SHIFT             (0U)
#define CSTCU_LASTRDEN_LRSERD0_WIDTH             (1U)
#define CSTCU_LASTRDEN_LRSERD0(x)                (((uint32_t)(((uint32_t)(x)) << CSTCU_LASTRDEN_LRSERD0_SHIFT)) & CSTCU_LASTRDEN_LRSERD0_MASK)
/*! @} */

/*! @name BYPLSTCU - Bypass LSTCU */
/*! @{ */

#define CSTCU_BYPLSTCU_BYP_L0_MASK               (0x1U)
#define CSTCU_BYPLSTCU_BYP_L0_SHIFT              (0U)
#define CSTCU_BYPLSTCU_BYP_L0_WIDTH              (1U)
#define CSTCU_BYPLSTCU_BYP_L0(x)                 (((uint32_t)(((uint32_t)(x)) << CSTCU_BYPLSTCU_BYP_L0_SHIFT)) & CSTCU_BYPLSTCU_BYP_L0_MASK)

#define CSTCU_BYPLSTCU_BYP_L1_MASK               (0x2U)
#define CSTCU_BYPLSTCU_BYP_L1_SHIFT              (1U)
#define CSTCU_BYPLSTCU_BYP_L1_WIDTH              (1U)
#define CSTCU_BYPLSTCU_BYP_L1(x)                 (((uint32_t)(((uint32_t)(x)) << CSTCU_BYPLSTCU_BYP_L1_SHIFT)) & CSTCU_BYPLSTCU_BYP_L1_MASK)

#define CSTCU_BYPLSTCU_BYP_L2_MASK               (0x4U)
#define CSTCU_BYPLSTCU_BYP_L2_SHIFT              (2U)
#define CSTCU_BYPLSTCU_BYP_L2_WIDTH              (1U)
#define CSTCU_BYPLSTCU_BYP_L2(x)                 (((uint32_t)(((uint32_t)(x)) << CSTCU_BYPLSTCU_BYP_L2_SHIFT)) & CSTCU_BYPLSTCU_BYP_L2_MASK)

#define CSTCU_BYPLSTCU_BYP_L3_MASK               (0x8U)
#define CSTCU_BYPLSTCU_BYP_L3_SHIFT              (3U)
#define CSTCU_BYPLSTCU_BYP_L3_WIDTH              (1U)
#define CSTCU_BYPLSTCU_BYP_L3(x)                 (((uint32_t)(((uint32_t)(x)) << CSTCU_BYPLSTCU_BYP_L3_SHIFT)) & CSTCU_BYPLSTCU_BYP_L3_MASK)

#define CSTCU_BYPLSTCU_BYP_L4_MASK               (0x10U)
#define CSTCU_BYPLSTCU_BYP_L4_SHIFT              (4U)
#define CSTCU_BYPLSTCU_BYP_L4_WIDTH              (1U)
#define CSTCU_BYPLSTCU_BYP_L4(x)                 (((uint32_t)(((uint32_t)(x)) << CSTCU_BYPLSTCU_BYP_L4_SHIFT)) & CSTCU_BYPLSTCU_BYP_L4_MASK)

#define CSTCU_BYPLSTCU_BYP_L5_MASK               (0x20U)
#define CSTCU_BYPLSTCU_BYP_L5_SHIFT              (5U)
#define CSTCU_BYPLSTCU_BYP_L5_WIDTH              (1U)
#define CSTCU_BYPLSTCU_BYP_L5(x)                 (((uint32_t)(((uint32_t)(x)) << CSTCU_BYPLSTCU_BYP_L5_SHIFT)) & CSTCU_BYPLSTCU_BYP_L5_MASK)

