zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CSTCU.h
#define CSTCU_BYPLSTCU_BYP_L6_MASK               (0x40U)
#define CSTCU_BYPLSTCU_BYP_L6_SHIFT              (6U)
#define CSTCU_BYPLSTCU_BYP_L6_WIDTH              (1U)
#define CSTCU_BYPLSTCU_BYP_L6(x)                 (((uint32_t)(((uint32_t)(x)) << CSTCU_BYPLSTCU_BYP_L6_SHIFT)) & CSTCU_BYPLSTCU_BYP_L6_MASK)

#define CSTCU_BYPLSTCU_BYP_L7_MASK               (0x80U)
#define CSTCU_BYPLSTCU_BYP_L7_SHIFT              (7U)
#define CSTCU_BYPLSTCU_BYP_L7_WIDTH              (1U)
#define CSTCU_BYPLSTCU_BYP_L7(x)                 (((uint32_t)(((uint32_t)(x)) << CSTCU_BYPLSTCU_BYP_L7_SHIFT)) & CSTCU_BYPLSTCU_BYP_L7_MASK)

#define CSTCU_BYPLSTCU_BYP_L8_MASK               (0x100U)
#define CSTCU_BYPLSTCU_BYP_L8_SHIFT              (8U)
#define CSTCU_BYPLSTCU_BYP_L8_WIDTH              (1U)
#define CSTCU_BYPLSTCU_BYP_L8(x)                 (((uint32_t)(((uint32_t)(x)) << CSTCU_BYPLSTCU_BYP_L8_SHIFT)) & CSTCU_BYPLSTCU_BYP_L8_MASK)

#define CSTCU_BYPLSTCU_BYP_L9_MASK               (0x200U)
#define CSTCU_BYPLSTCU_BYP_L9_SHIFT              (9U)
#define CSTCU_BYPLSTCU_BYP_L9_WIDTH              (1U)
#define CSTCU_BYPLSTCU_BYP_L9(x)                 (((uint32_t)(((uint32_t)(x)) << CSTCU_BYPLSTCU_BYP_L9_SHIFT)) & CSTCU_BYPLSTCU_BYP_L9_MASK)

#define CSTCU_BYPLSTCU_BYP_L10_MASK              (0x400U)
#define CSTCU_BYPLSTCU_BYP_L10_SHIFT             (10U)
#define CSTCU_BYPLSTCU_BYP_L10_WIDTH             (1U)
#define CSTCU_BYPLSTCU_BYP_L10(x)                (((uint32_t)(((uint32_t)(x)) << CSTCU_BYPLSTCU_BYP_L10_SHIFT)) & CSTCU_BYPLSTCU_BYP_L10_MASK)

#define CSTCU_BYPLSTCU_BYP_L11_MASK              (0x800U)
#define CSTCU_BYPLSTCU_BYP_L11_SHIFT             (11U)
#define CSTCU_BYPLSTCU_BYP_L11_WIDTH             (1U)
#define CSTCU_BYPLSTCU_BYP_L11(x)                (((uint32_t)(((uint32_t)(x)) << CSTCU_BYPLSTCU_BYP_L11_SHIFT)) & CSTCU_BYPLSTCU_BYP_L11_MASK)
/*! @} */

/*! @name STAG - Stagger */
/*! @{ */

#define CSTCU_STAG_MB_DELAY_MASK                 (0xFF00U)
#define CSTCU_STAG_MB_DELAY_SHIFT                (8U)
#define CSTCU_STAG_MB_DELAY_WIDTH                (8U)
#define CSTCU_STAG_MB_DELAY(x)                   (((uint32_t)(((uint32_t)(x)) << CSTCU_STAG_MB_DELAY_SHIFT)) & CSTCU_STAG_MB_DELAY_MASK)

#define CSTCU_STAG_LB_DELAY_MASK                 (0xFF0000U)
#define CSTCU_STAG_LB_DELAY_SHIFT                (16U)
#define CSTCU_STAG_LB_DELAY_WIDTH                (8U)
#define CSTCU_STAG_LB_DELAY(x)                   (((uint32_t)(((uint32_t)(x)) << CSTCU_STAG_LB_DELAY_SHIFT)) & CSTCU_STAG_LB_DELAY_MASK)
/*! @} */

/*! @name LMBPTR - LSTCU MBIST Run Phase Scheduler Pointer */
/*! @{ */

#define CSTCU_LMBPTR_MBPTR_MASK                  (0xFFU)
#define CSTCU_LMBPTR_MBPTR_SHIFT                 (0U)
#define CSTCU_LMBPTR_MBPTR_WIDTH                 (8U)
#define CSTCU_LMBPTR_MBPTR(x)                    (((uint32_t)(((uint32_t)(x)) << CSTCU_LMBPTR_MBPTR_SHIFT)) & CSTCU_LMBPTR_MBPTR_MASK)

#define CSTCU_LMBPTR_MBCSM_MASK                  (0x100U)
#define CSTCU_LMBPTR_MBCSM_SHIFT                 (8U)
#define CSTCU_LMBPTR_MBCSM_WIDTH                 (1U)
#define CSTCU_LMBPTR_MBCSM(x)                    (((uint32_t)(((uint32_t)(x)) << CSTCU_LMBPTR_MBCSM_SHIFT)) & CSTCU_LMBPTR_MBCSM_MASK)

#define CSTCU_LMBPTR_MBEOL_MASK                  (0x80000000U)
#define CSTCU_LMBPTR_MBEOL_SHIFT                 (31U)
#define CSTCU_LMBPTR_MBEOL_WIDTH                 (1U)
#define CSTCU_LMBPTR_MBEOL(x)                    (((uint32_t)(((uint32_t)(x)) << CSTCU_LMBPTR_MBEOL_SHIFT)) & CSTCU_LMBPTR_MBEOL_MASK)
/*! @} */

/*! @name LLBPTR - LSTCU LBIST Run phase Scheduler Pointer */
/*! @{ */

#define CSTCU_LLBPTR_LBPTR_MASK                  (0xFFU)
#define CSTCU_LLBPTR_LBPTR_SHIFT                 (0U)
#define CSTCU_LLBPTR_LBPTR_WIDTH                 (8U)
#define CSTCU_LLBPTR_LBPTR(x)                    (((uint32_t)(((uint32_t)(x)) << CSTCU_LLBPTR_LBPTR_SHIFT)) & CSTCU_LLBPTR_LBPTR_MASK)

#define CSTCU_LLBPTR_LBCSM_MASK                  (0x100U)
#define CSTCU_LLBPTR_LBCSM_SHIFT                 (8U)
#define CSTCU_LLBPTR_LBCSM_WIDTH                 (1U)
#define CSTCU_LLBPTR_LBCSM(x)                    (((uint32_t)(((uint32_t)(x)) << CSTCU_LLBPTR_LBCSM_SHIFT)) & CSTCU_LLBPTR_LBCSM_MASK)

#define CSTCU_LLBPTR_LBEOL_MASK                  (0x80000000U)
#define CSTCU_LLBPTR_LBEOL_SHIFT                 (31U)
#define CSTCU_LLBPTR_LBEOL_WIDTH                 (1U)
#define CSTCU_LLBPTR_LBEOL(x)                    (((uint32_t)(((uint32_t)(x)) << CSTCU_LLBPTR_LBEOL_SHIFT)) & CSTCU_LLBPTR_LBEOL_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group CSTCU_Register_Masks */

/*!
 * @}
 */ /* end of group CSTCU_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_CSTCU_H_) */
